areiter128/USB-PD-BoB/dspic/h/smps_control.h
/**************************************************************************
  Company:
    Microchip Technology Inc.
  File Name:
    smps_control.h


  Summary:
    This header file lists the interfaces used by the Switch Mode Power
    Supply compensator library.


  Description:
    SMPS Control (Compensator) library interface header file

    This header file lists the type defines for structures used by the SMPS
    library. Library function definitions are also listed along with
    information regarding the arguments of each library function.
  **************************************************************************/

// DOM-IGNORE-BEGIN
////////////////////////////////////////////////////////////////////////////////
// © 2015 Microchip Technology Inc.
//
// MICROCHIP SOFTWARE NOTICE AND DISCLAIMER:  You may use this software, and any 
//derivatives, exclusively with Microchip?s products. This software and any 
//accompanying information is for suggestion only.  It does not modify Microchip?s 
//standard warranty for its products.  You agree that you are solely responsible 
//for testing the software and determining its suitability.  Microchip has no 
//obligation to modify, test, certify, or support the software.
//
// THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS".  NO WARRANTIES, WHETHER EXPRESS,
//IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF
//NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE, OR ITS 
//INTERACTION WITH MICROCHIP PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE 
//IN ANY APPLICATION.
 
//IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL 
//OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE 
//SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR 
//THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP'S 
//TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT EXCEED 
//THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.

//MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF THESE TERMS. 

////////////////////////////////////////////////////////////////////////////////
// DOM-IGNORE-END

#ifndef _SMPS_CONTROL_H		// Guards against multiple inclusion
#define _SMPS_CONTROL_H

// *****************************************************************************
// *****************************************************************************
// Section: Included Files
// *****************************************************************************
// *****************************************************************************

#include <xc.h>
#include <stdint.h>

#ifdef __cplusplus  // Provide C++ Compatibility
    extern "C" {
#endif

// *****************************************************************************
// *****************************************************************************
// Section: Data Types
// *****************************************************************************
// *****************************************************************************

//**************************************************************************
/* Data type for the 3-pole 3-zero (3P3Z) controller

  Summary:
    Data type for the 3-pole 3-zero (3P3Z) controller

  Description:
    The 3P3Z controller is the digital implementation of the analog type III
    controller. This is a filter which generates a compensator characteristic
    considering three poles and three zeros. This controller requires four
    feedback errors multiplied by their associated coefficients plus the three
    latest controller output values multiplied by their associated coefficients
    along the delay line to provide proper compensation of the power converter.
    The coefficients are determined externally using Digital Compensator Design
    Tool (DCDT) by Microchip.

    The SMPS_3P3Z_T data structure contains a pointer to derived
    coefficients in X-space and pointer to error/control history samples in
    Y-space. User must declare variables for the derived coefficients and
    the error history samples.

    The abCoefficients referenced by the SMPS_3P3Z_T data structure are
    derived from the coefficients B0-B3 and A1-A3. These will be declared
    in external arrays. The SMPS_3P3Z_T data structure just holds pointers
    to these arrays.

    The coefficients will be determined by simulation tools, their outputs are
    given as floating point numbers. These numbers will be copied into the
    declared arrays after they have been converted into 16-bit integer numbers.

*/

typedef struct
{
    int16_t*    aCoefficients ;         // Pointer to A coefficients located in X-space
    int16_t*    bCoefficients ;         // Pointer to B coefficients located in X-space
    int16_t*    controlHistory ;	// Pointer to 3 delay-line samples located in Y-space
                                        // with the first sample being the most recent
    int16_t*    errorHistory ;          // Pointer to 4 delay-line samples located in Y-space
                                        // with the first sample being the most recent
    uint16_t    preShift ;		// Normalization from ADC-resolution to Q15 (R/W)
    int16_t     postShift ;		// Normalization bit-shift from Q15 to PWM register resolution (R/W)
    int16_t     postScaler ;		// Controller output post-scaler  (R/W)
    uint16_t    minOutput ;		// Minimum output value used for clamping (R/W)
    uint16_t    maxOutput ;		// Maximum output value used for clamping (R/W)
} SMPS_3P3Z_T;

// *****************************************************************************
/* Data type for the 2-pole 2-zero (2P2Z) controller

  Summary:
	Data type for the 2-pole 2-zero (2P2Z) controller

  Description:
	The 2P2Z controller is the digital implementation of the analog type II
	controller. This is a filter which generates a compensator characteristic
	considering two poles and two zeros. This controller requires three feedback
	error multiplied by their associated coefficients plus the two latest
	controller output values multiplied by their associated coefficients along
	the delay line to provide proper compensation of the power converter.
	The coefficients are determined externally using Digital Compensator Design
    Tool (DCDT) by Microchip.

