areiter128/USB-PD-BoB/dspic/h/smps_control.h
    The SMPS_2P2Z_T data structure contains a pointer to derived
    coefficients in X-space and pointer to error/control history samples in
    Y-space. User must declare variables for the derived coefficients and
    the error history samples.

    The abCoefficients referenced by the SMPS_2P2Z_T data structure are
    derived from the coefficients B0-B2 and A1-A2. These will be declared
    in external arrays. The SMPS_2P2Z_T data structure and just holds
    pointers to these arrays.

    The coefficients will be determined by simulation tools, which output
    is given as floating point numbers. These numbers will be copied into
    the declared arrays after they have been converted into 16-bit integer
    numbers.
*/
typedef struct
{
    int16_t*    aCoefficients ;         // Pointer to A coefficients located in X-space
    int16_t*    bCoefficients ;         // Pointer to B coefficients located in X-space
    int16_t*    controlHistory ;	// Pointer to 2 delay-line samples located in Y-space
                                        // with the first sample being the most recent
    int16_t*    errorHistory ;          // Pointer to 3 delay-line samples located in Y-space
                                        // with the first sample being the most recent
    uint16_t    preShift ;		// Normalization from ADC-resolution to Q15 (R/W)
    int16_t     postShift ;		// Normalization bit-shift from Q15 to PWM register resolution (R/W)
    int16_t     postScaler ;		// Controller output post-scaler  (R/W)
    uint16_t    minOutput ;		// Minimum output value used for clamping (R/W)
    uint16_t    maxOutput ;		// Maximum output value used for clamping (R/W)
} SMPS_2P2Z_T ;

//***********************************************************************
/* Data type for the PID controller

  Summary:
    Data type for the PID controller

  Description:
	Data type for the Proportional Integral Derivative (PID) controller

    This digital implementation of a PID controller is a filter which
    generates a compensator characteristic considering the values of the
    coefficients KA, KB, KC these coefficients will determine the
    converter's frequency response. The coefficients are determined externally 
    using Digital Compensator Design Tool (DCDT) by Microchip.

    This function call includes the pointer to the controller data
    structure, pointer of the input source register, control reference
    value, and to the pointer to the output register.
 */
typedef struct {

    int16_t*  abcCoefficients;	// Pointer to A, B & C coefficients located in X-space
                                // These coefficients are derived from
                                // the PID gain values - Kp, Ki and Kd
    int16_t*  errorHistory;	// Pointer to 3 delay-line samples located in Y-space
				            // with the first sample being the most recent
    int16_t  controlHistory;    // Stores the most recent controller output (n-1)
    int16_t  postScaler;	// PID basic Coefficient scaling Factor
    int16_t  preShift ;		// Normalization from ADC-resolution to Q15 (R/W)
    int16_t  postShift;		// Normalization from DSP to PWM register
    uint16_t minOutput;		// Minimum output value used for clamping
    uint16_t maxOutput;		// Maximum output value used for clamping


} SMPS_PID_T;




// *****************************************************************************
// *****************************************************************************
// Section: Interface Routines
// *****************************************************************************
// *****************************************************************************

/************************************************************************
  Function:
    void SMPS_3P3ZInitialize( SMPS_3P3Z_T *controller_data )

  Summary:
    This function clears the SMPS_3P3Z_T data history structure arrays

  Description:
    This function clears the SMPS_3P3Z_T data history structure arrays.
	It's recommended to clear the error-history and controller-history
	arrays before 3P3Z controller implementation.
  Conditions:
    None.
  Input:
    SMPS_3P3Z_T * -  This parameter is a pointer to a SMPS_3P3Z_T type
                     structure
  Return:
    Void.
  Example:
    <code lang="c++">
    SMPS_3P3Z_T controller3P3Z;
    SMPS_3P3ZInitialize(&amp;controller3P3Z);
    </code>

  ************************************************************************/

void SMPS_Controller3P3ZInitialize(SMPS_3P3Z_T *controllerData );

/*****************************************************************************************
  Function:
    \ \


    <code lang="c++">
        void SMPS_Controller3P3ZUpdate(SMPS_3P3Z_T* controllerData,
                                     volatile uint16_t* controllerInputRegister,
                                     int16_t reference,
                                     volatile uint16_t* controllerOutputRegister);
    </code>




  Summary:
    This function calls the SMPS_Controller3P3ZUpdate controller

  Description:
    This function updates the 3P3Z controller and can be called as soon as the
    coefficients have been loaded into their arrays.

  Conditions:
    Before the controller can be used, it has to be initialized. The data
    structure has to be filled by copying the pointers to the coefficient,
    error and controller history arrays to the structure and the physical
    clamping limits of the output value. In the function call pointers to
    the Input source register, reference value, and pointer to the output
    register need to be called.

  Input:
    SMPS_3P3Z_T * controllerData -        This parameter is a pointer to a
                                          SMPS_3P3Z_T type structure<p />
    uint16_t* controllerInputRegister -   This parameter is a pointer to the
                                          \input source register or variable
                                          being tracked by the 3P3Z (e.g.
                                          ADCBUF0).<p />
    int16_t reference -                   This parameter is a signed integer
                                          value that will be used by the
                                          controller as the feedback
                                          reference or set\-point.<p />
    uint16_t* controllerOutputRegister -  This parameter is a pointer to the
                                          Control loop target register of
                                          the calculated result(e.g. PDC1).
  Return:
    void
  Example:
    <code lang="c++">
    int16_t controlReference;
    SMPS_3P3Z_T controller3P3Z;
    SMPS_Controller3P3ZUpdate(&amp;controller3P3Z,&amp;ADCBUF0,controlReference,&amp;PDC1)
    </code>

