areiter128/USB-PD-BoB/dspic/h/smps_control.h
  *****************************************************************************************/


void SMPS_Controller3P3ZUpdate(SMPS_3P3Z_T* controllerData,
                               volatile uint16_t* controllerInputRegister,
			       int16_t reference,
			       volatile uint16_t* controllerOutputRegister);


/************************************************************************
  Function:
    void SMPS_Controller2P2ZUpdate_HW_Accel( void );

  Summary:
    This function calls the 2-Pole, 2-Zero compensator/controller.

  Description:
    This function updates the duty cycle register (PDCx) once every function call.
    There are three options via the structure SMPS_Controller_Options_T which allows the user
    to select whether the trigger update is enabled. The options are as follows:

    1. No trigger option is selected.

    2. Trigger On-Time is selected:

       Trigger Register = PDCx + (PTPER - PDCx)/2

    3. Trigger Off-Time is selected:

       Trigger Register = PDCx/2

    It's recommended to clear the error-history and controller-history arrays before
    2P2Z controller implementation.

    Conditions:  For use with the new 'dsPIC33EPGS' parts that have the Alternate
                 Working (Alt-W) register context features.

    Input:       None.
    Return:      Void.

  ************************************************************************/

void SMPS_Controller2P2ZUpdate_HW_Accel(void); // Function prototype for 2P2Z library

/*****************************************************************************************/



/************************************************************************
  Function:
    void SMPS_Controller3P3ZUpdate_HW_Accel( void );

  Summary:
    This function calls the 3-Pole, 3-Zero compensator/controller.

  Description:
    This function updates the duty cycle register (PDCx) once every function call.
    There are three options via the structure SMPS_Controller_Options_T which allows the user
    to select whether the trigger update is enabled. The options are as follows:

    1. No trigger option is selected.

    2. Trigger On-Time is selected:

       Trigger Register = PDCx + (PTPER - PDCx)/2

    3. Trigger Off-Time is selected:

       Trigger Register = PDCx/2

    It's recommended to clear the error-history and controller-history arrays before
    the calling the 3P23 compensator/controller.

    Conditions:  For use with the new 'dsPIC33EPGS' parts that have the Alternate
                 Working (Alt-W) register context features.

    Input:       None.
    Return:      Void.

  ************************************************************************/

void SMPS_Controller3P3ZUpdate_HW_Accel(void); // Function prototype for 3P3Z library

/*************************************************************************/



/************************************************************************
  Function:
    void SMPS_Controller4P4ZUpdate_HW_Accel( void );

  Summary:
    This function calls the 4-Pole, 4-Zero compensator/controller.

  Description:
    This function updates the duty cycle register (PDCx) once every function call.
    There are three options via the structure SMPS_Controller_Options_T which allows the user
    to select whether the trigger update is enabled. The options are as follows:

    1. No trigger option is selected.

    2. Trigger On-Time is selected:

       Trigger Register = PDCx + (PTPER - PDCx)/2

    3. Trigger Off-Time is selected:

       Trigger Register = PDCx/2

    It's recommended to clear the error-history and controller-history arrays before
    the calling the 4P4P compensator/controller.

    Conditions:  For use with the new 'dsPIC33EPGS' parts that have the Alternate
                 Working (Alt-W) register context features.

    Input:       None.
    Return:      Void.

  ************************************************************************/
void SMPS_Controller4P4ZUpdate_HW_Accel(void); // Function prototype for 3P3Z library

/*************************************************************************/

void SMPS_ControllerCascadeUpdate_HW_Accel(void);

/************************************************************************
  Function:
    void SMPS_ControllerPIDUpdate_HW_Accel( void );

  Summary:
    This function calls the PID compensator/controller.

  Description:
    This function updates the duty cycle register (PDCx) once every function call.
    There are three options via the structure SMPS_Controller_Options_T which allows the user
    to select whether the trigger update is enabled. The options are as follows:

    1. No trigger option is selected.

    2. Trigger On-Time is selected:

       Trigger Register = PDCx + (PTPER - PDCx)/2

    3. Trigger Off-Time is selected:

       Trigger Register = PDCx/2

    It's recommended to clear the error-history and controller-history arrays before
    the calling the PID compensator/controller.

    Conditions:  For use with the new 'dsPIC33EPGS' parts that have the Alternate
                 Working (Alt-W) register context features.

    Input:       None.
    Return:      Void.

  ************************************************************************/

void SMPS_ControllerPIDUpdate_HW_Accel(void); // Function prototype for PID library

/*************************************************************************/



typedef struct {

     uint16_t  triggerSelectFlag; // 00 = No Trigger Enabled
	                          // 01 = Trigger On-Time Enabled
			          // 10 = Trigger Off-Time Enabled

     uint16_t                delayValue;      //
     volatile unsigned int*  trigger;         // Pointer to trigger source
     volatile unsigned int*  period;          // Pointer to time base (i.e., PTPER) register

     // User to add additional structure elements as needed
     //             .
     //             .
     //             .

} SMPS_Controller_Options_T; // Converter User Enabled Options



//void SMPS_Controller3P3Z(CONVERTER* controllerData);



/************************************************************************
  Function:
          void SMPS_2P2ZInitialize(void)

  Summary:
    This function clears the SMPS_2P2Z_T data structure arrays

  Description:
    This function clears the SMPS_2P2Z_T data history structure arrays.
	It's recommended to clear the error-history and controller-history
	arrays before 2P2Z controller implementation.

  Conditions:
    None.
  Input:
    SMPS_2P2Z_T* -  This parameter is a pointer to a SMPS_2P2Z_T type
                    structure
  Return:
    void
  Example:
    <code lang="c++">
    SMPS_2P2Z_T controller2P2Z;
    SMPS_Controller2P2ZUpdateInitialize(&amp;controller2P2Z);
    </code>

  ************************************************************************/

void SMPS_Controller2P2ZInitialize(SMPS_2P2Z_T *controllerData);


/*****************************************************************************************
  Function:
    \ \


