areiter128/USB-PD-BoB/dspic/h/smps_control.h
    <code>
        void SMPS_Controller2P2ZUpdate(SMPS_2P2Z_T* controllerData,
                                       volatile uint16_t* controllerInputRegister,
                                       int16_t reference,
                                       volatile uint16_t* controllerOutputRegister);

    </code>
  Summary:
    This function calls the SMPS_Controller2P2ZUpdate controller

  Description:
    This function updates the 2P2Z controller and can be called as soon as the
	coefficients have been loaded into their arrays.

  Conditions:
    Before the controller can be used, it has to be initialized. The data
    structure has to be filled by copying the pointers to the coefficient,
    error and controller history arrays to the structure and the physical
    clamping limits of the output value. In the function call pointers to
    the Input source register, reference value, and pointer to the output
    register need to be called.
  Input:
    SMPS_2P2Z_T * controllerData -        This parameter is a pointer to a
                                          SMPS_2P2Z_T type structure<p />
    uint16_t* controllerInputRegister -   This parameter is a pointer to the
                                          \input source register or variable
                                          being tracked by the 2P2Z (e.g.
                                          ADCBUF0).<p />
    int16_t reference -                   This parameter is a signed integer
                                          value that will be used by the
                                          controller as the feedback
                                          reference or set\-point.<p />
    uint16_t* controllerOutputRegister -  This parameter is a pointer to the
                                          Control loop target register of
                                          the calculated result(e.g. PDC1).
  Return:
    void
  Example:
    <code lang="c++">
    int16_t controlReference;
    SMPS_2P2Z_T controller2P2Z;
    SMPS_Controller2P2ZUpdate(&amp;controller2P2Z,&amp;ADCBUF0,controlReference,&amp;PDC1)
    </code>

  *****************************************************************************************/

void SMPS_Controller2P2ZUpdate(SMPS_2P2Z_T* controllerData,
                               volatile uint16_t* controllerInputRegister,
                               int16_t reference,
                               volatile uint16_t* controllerOutputRegister);


/****************************************************************************
  Function:
          void SMPS_PIDInitialize( SMPS_PID_T *controller_data )

  Summary:
    This function clears the SMPS_PID_T data structure arrays

  Description:
    This function clears the SMPS_PID_T data history structure arrays.
	It's recommended to clear the error-history and controller-history
	arrays before PID controller implementation.

  Conditions:
    None.
  Input:
    SMPS_PID_T* -  This parameter is a pointer to a SMPS_PID_T type structure
  Return:
    void
  Example:
    <code lang="c++">
    SMPS_PID_T controllerPID;
    SMPS_ControllerPIDUpdateInitialize(&amp;controllerPID);
    </code>

  ****************************************************************************/
void SMPS_ControllerPIDInitialize(SMPS_PID_T *controllerData );

/***************************************************************************************
  Function:
    \ \


    <code>
      void SMPS_ControllerPIDUpdate(SMPS_PID_T* controllerData,
                                   volatile uint16_t* controllerInputRegister,
                                   int16_t reference,
                                   volatile uint16_t* controllerOutputRegister);
    </code>




  Summary:
    This function calls the SMPS_ControllerPIDUpdate controller

  Description:
    This function updates the PID controller and can be called as soon as the
	coefficients have been loaded into their arrays.

  Conditions:
    Before the controller can be used, it has to be initialized. The data
    structure has to be filled by copying the pointers to the coefficient,
    error and controller history arrays to the structure and the physical
    clamping limits of the output value. In the function call pointers to
    the Input source register, reference value, and pointer to the output
    register need to be called.

  Input:
    SMPS_PID_T * controllerData -         This parameter is a pointer to a
                                          SMPS_PID_T type structure<p />
    uint16_t* controllerInputRegister -   This parameter is a pointer to the
                                          \input source register or variable
                                          being tracked by the PID (e.g.
                                          ADCBUF0).<p />
    int16_t reference -                   This parameter is a signed integer
                                          value that will be used by the
                                          controller as the feedback
                                          reference or set\-point.<p />
    uint16_t* controllerOutputRegister -  This parameter is a pointer to the
                                          Control loop target register of
                                          the calculated result(e.g. PDC1).
  Return:
    void
  Example:
    <code lang="c++">
    int16_t controlReference;
    SMPS_PID_T controllerPID;
    SMPS_ControllerPIDUpdate(&amp;controllerPID,&amp;ADCBUF0,controlReference,&amp;PDC1)
    </code>

  ***************************************************************************************/
void SMPS_ControllerPIDUpdate(SMPS_PID_T* controllerData,
                              volatile uint16_t* controllerInputRegister,
                              int16_t reference,
                              volatile uint16_t* controllerOutputRegister);


#ifdef __cplusplus  // Provide C++ Compatibility
    }
#endif

#endif // _SMPS_CONTROL_H

/* EOF */


